{
  "lang_name": "简体中文",
  "translators": "<li> <a href=\"https://github.com/lixiang810\" >lixiang810</a></li>",
  "ui_index_title": "Langsorter / 语言大评测",
  "ui_index_text": "<h2>Langsorter 是什么？</h2><p>Langsorter 本质上是一个心理学测验，它将通过向你提出问题来得出一个与你的心灵最贴合的编程语言。这个测试将基于流程图模型，根据你对这些问题的回答，把<span id='ideo_length'></span>种不同编程语言之一分配给你。也许你能贴合一些你自己知道的语言！</p><h2>我不明白其中一个问题！</h2><p>这个测验是一个心灵测验，如果你有什么不懂的，跟着你的感觉走就行了。</p><h2>我不喜欢我被匹配到的编程语言！</h2><p>¯\\_(ツ)_/¯</p>",
  "ui_index_start": "点击开始",
  "ui_index_tree": "查看结果树",
  "ui_index_contacts": "作者",
  "ui_index_contact_info": "<p><a href=\"https://github.com/is-cau/Langsorter\">GitHub 页面</a></p>",
  "ui_quiz_title": "语言大测评",
  "ui_quiz_back": "后退",
  "ui_results_title": "语言大测评",
  "ui_results_back": "返回首页",
  "ui_results_credits": "贡献者",
  "question_model": "如果你的面前有一个巨大到你可能难以解决的难题即将来临，你是选择动手强硬地快速解决，还是看着时机船到桥头自然直？",
  "question_type": "如果你的面前其实是一头怪兽，你是想用一击毙命但位置不能射错的弓箭杀死它，还是想用灵活但不那么锋利的短剑杀死他？",
  "question_mop": "你数学和物理两科的成绩哪个高？",
  "question_eot": "你更喜欢工程还是理论？",
  "question_coin": "你之前打死的怪兽掉落金币了，你希望得到一个花纹繁复的传统古硬币还是花纹简洁更现代的新硬币。",
  "question_mbti": "如果你的面前有一个你喜欢的蛋糕，请问它的上表面是自由随性比较凹凸不平的，还是规则统一具有平滑光泽的？",
  "question_fruit": "如果你的面前有一个很可口的水果，你希望它来自于丰饶的黄金国度，还是神秘的桃花源中？",
  "question_fxxklang": "如果你一定会遇到一个你可能无法解决的难题，你希望这个难题是人为设计的谜题，还是现实中存在的疑难杂症？",
  "question_puzzle": "你希望这个难题在难题的等级中有多难？（也就是说在它已经是难题的情况下）",
  "ideo_free_python": "非工程化的 Python",
  "ideo_free_python_desc": "Python 是一个命令式的语言。若你不对其使用工程化的手段，它用起来和弱类型语言没有什么差别。以上两点分别对应你之前选择的选项。<br>Python 是非常流行的语言，以方便简洁易用著称，适合多种人群，社区活跃！",
  "ideo_cpp": "C++",
  "ideo_cpp_desc": "被广泛使用的 C++ （与现代 C++ 不同）是一个命令式的语言。虽然其也有类型系统辅助验证程序是否正确，但通常一言难尽。历史“悠久”，语法传统。相较于 C 语言的“纯净感”， C++ 能混用多种编程范式，代码风格随使用者不同而不同（易读性也是）。以上四点分别对应你之前选择的选项。<br>如信息学竞赛和学长祖传代码等，是这种语言出没的重点地区。其知名度非常广，更多资料你可以搜索得到！",
  "ideo_new_cpp": "现代 C++",
  "ideo_new_cpp_desc": "现代 C++ 与传统 C++ 有很大的差别。虽然你可以使用函数式编程，但其仍然以命令式为主。现代 C++ 有较为完善的类型系统可用于验证程序是否正确。由于需要手动管理内存，它通常用于编写偏底层的系统级应用。以上三点分别对应你之前选择的选项。<br>现在有一个叫 Rust 的语言正在尝试与其竞争，具有一定函数式风格和略显奇特的语法，与你的性格说不定也合得来。不论如何，只要是学习这类语言，你可能都要经历一段略显陡峭的学习曲线。现代 C++ 也是一个热门话题，更多资料你可以搜索得到！",
  "ideo_c": "C",
  "ideo_c_desc": "C 语言是一个命令式的语言。相较于它一言难尽的类型系统，程序员的代码水平在保证程序的正确性方面更加重要。它的历史非常悠久，语法也很经典传统。直到现在，它的语法风格也较为统一，不会如 C++ 一般出现各种奇葩的编程范式。以上四点分别对应你之前选择的选项。<br>其知名度非常广，更多资料你可以搜索得到！",
  "ideo_java": "Java",
  "ideo_java_desc": "Java 是一个命令式语言（不是不能写函数式代码，只是 Java 社区中的大多数人都认为 Java 的函数式不能用得太广，否则晦涩难懂）。 Java 同时还是比较严格的面向对象语言，意味着他的类型系统存在感很强，约束你的程序。它虽然发明是为了嵌入式等场景，但目前最广泛被应用的地方是网络工程，如网站和游戏的后端等，不论如何，它并不是一个很底层的语言。同一些新兴的语言相比，它的历史也较长，语法等方面唯美传统。以上四点分别对应你之前选择的选项。<br>其知名度非常广，更多资料你可以搜索得到！",
  "ideo_js": "JavaScript",
  "ideo_js_desc": "JS 是一个命令式和函数式兼有的语言，比较灵活。同时，与 TypeScript 不同，纯的 JS 是一个超级弱类型语言，各种有关 JS 类型系统的笑话满天飞，不过这也意味着如果你对自己的水平很自信的话， JS 能被你写得自由自在、无拘无束。虽然其被发明于互联网刚兴起时，但直到现在仍保持每年都更新，越来越现代。不论你写的是哪种环境的 JS ，你一份代码的整体风格都基本是统一的。以上四点分别对应你之前选择的选项。<br>其知名度非常广，更多资料你可以搜索得到！",
  "ideo_ts": "TypeScript",
  "ideo_ts_desc": "TypeScript 是 JavaScript 的改进版，这意味着 JS 所具有的命令式与函数式兼可使用、比较灵活的特点，在 TS 身上也都有。 TS 对 JS 的改进主要在提供了一个类型检查工具 <code>tsc</code> ，这意味着你可以选择被限制编写过于奔放、无视静态检查的代码，而写出准确、相对安全的代码。同其他范式灵活、强类型的语言相比， TS 是非常年轻、新潮的选择。如果你了解过 Rust ，它与 TS 在这些方面都很相似，除了—— Rust 更加底层，而 TS 某些程度更加抽象。以上四点分别对应你之前选择的选项。<br>如果你想要学习网络前端，设计网页、小程序等，越早与 TS 交朋友越好。如果你不喜欢前端，却得到了这个结果，你也可以试着了解用 TS 编写如 npm 包或命令行工具等与前端无关的东西。本身大多数人对 TS 的评价就是“编写很爽”，你也可以尝试一下，去<a href=\"https://www.typescriptlang.org/zh/\">他们的官网</a>了解一下，希望你能在其中得到快乐。",
  "ideo_go": "go",
  "ideo_go_desc": "go 语言包括其整体社区的风格都是非常朴实、偏向工程的，所以他和 C 语言一样更偏向命令式语言，像函数式这种过于学术气息的风味在它的身上基本找不到。为了工程开发时得到高质量、易读且准确的代码，它同时还是一个强类型语言，使用类型系统约束程序。为了工程开发的速度更快，错误更少，它也不需要你手动管理内存，而是把很多相关细节抽象起来，使你远离底层的约束。类似（但也不是很类似）定位的语言还有比较广为人知的 Java ，但 go 语言更加年轻，也更有活力。以上四点分别对应你之前选择的选项。<br>go 语言目前主要的舞台是网络工程中的后端，据说 bilibili 的网站服务器就是使用 go 语言编写的。网络后端生态位主要就是 go 、 Java 和 php 三种语言，而 php 的工程性太弱， Java 太老，所以从这个方面来看， go 语言还是具有比较美好的前景的。这里是<a href=\"https://golang.google.cn/\">他们的官网</a>。",
  "ideo_sql": "SQL",
  "ideo_sql_desc": "SQL 是一种关系型数据库（也就是类似 Excel 那样数据一条一条的数据库）的查询语言，但它提供的功能过多，以至于你可以洋洋洒洒地写下几页数据库查询代码来代替服务器后台由其他语言实现的逻辑。尤其是其恰到好处的功能繁杂和恰到好处的语法简略，能沉浸其中享受其乐趣的人少之又少，和同普通编程语言相比非常丧心病狂。只使用最低限度的 SQL 完全是可以的，以至于实际上大多数网络公司都只使用最低限度的 SQL 来保证可维护性（为什么还不能彻底把这东西扔走），但如果你希望给自己增加有趣（实际上可能一点也不有趣）且困难的难题，使用 SQL 是你非常好的选择！",
  "ideo_vb": "Visual Basic",
  "ideo_vb_desc": "如果你不知道 VB 是什么语言，你应该知道 BASIC 语言，那是你爸妈辈的人会学的神秘的古老而原始的技艺。本身这个古老语言就已经不适合现代人进行编写，而微软在 BASIC 上增加的图形界面功能以及各种不断的大刀阔斧的更新则是把这个黏糊糊的东西彻底推出人类社会——且慢！你应该知道不太讨喜的微软公司会在操作系统里绑定 IE 浏览器，那你知道微软也会在 Excel 等软件里让你使用 VBA 和 VBS 等 VB 语言的子女吗？没错，如果你觉得生活过于顺利或者人生过于成功，微软还是有提供一个这样的平台让你挑战自我的。",
  "ideo_fortran": "FORTRAN / Fortran",
  "ideo_fortran_desc": "Fortran ，多用在各种科学计算和祖传老代码等领域，所以其兼容性很强，不论是偏工程的命令式风格还是偏学术的函数式风格，它都能驾驭。为了保证代码的正确性， Fortran 也通过强类型系统来约束代码。 Fortran 是世界上第一个高级计算机语言，最早在 1957 年被提出，而 Fortran 90 标准直到现在也仍然被广泛使用，历史非常悠久。其名字来源于 Formula Translation 也就是公式转换语言，用它的多是理论学者。以上四点分别对应你之前选择的选项。<br>虽说其与时俱进（因为不论哪个时代，都有 Fortran 代码需要维护），添加了很多新时代的特性，但总体来说，它在学术领域的地位仍然是慢慢在被如 Python 这样的语言夺走。然而其与 Python 的风格大为不同，尤其是在函数式风格方面。究竟是选择更有可能适合你性格的 Fortran ，还是跟随时代选择 Python ，你可以仔细考虑考虑。",
  "ideo_asm": "汇编",
  "ideo_asm_desc": "汇编语言你可能没听说过，但是你听过用电话线连电脑，按 0 和 1 来手写程序的段子吗？没错，使用汇编编写程序跟手写 0 和 1 基本没有区别。汇编不是一种高级语言，其实际上是一种符号。比如在 x86 架构的 16 位 CPU 中， <code>ADD BP,BX</code> 就表示二进制指令 <code>0000000111011101</code> ，其中前八位就是 <code>ADD</code> ，表示加法。不同设备使用的汇编代码也不同。在现在的时代，手写汇编代码一般是为了炫技、探寻计算机底层原理、或得到极致的手工性能优化。",
  "ideo_php": "php",
  "ideo_php_desc": "首先，请跟我一起读：“ php 是世界上最好的语言！”<br>php 是一个神奇的语言，不论你是喜欢偏向直接了当的命令式代码，还是更有描述性的函数式代码，它都可以满足你。同时，编写 php 唯一需要的就是灵感，几乎没有任何类型系统层面的限制来强制你写出诸如“正确”“高效”……那些陈词滥调的的程序，完全可以自由地发挥。虽然 php 在互联网的早期就被用作编写网络后端服务器，一直有人说 php 要被某些竞争对手所“灭亡”，但直到现在它仍然在积极的引入各种新的语言特性，显现一副勃勃生机、跳来跳去的样子。在此基础上，其各种历史遗留写法导致你可以彻底在语法层面放飞自我，写出类似狗屎但作为作者的你可以理解其美丽优雅的代码。以上四点分别对应你之前选择的选项。<br>说 php 是世界上最好的编程语言可能会有非常多的人反对，但说 php 是世界上最具有广泛戏剧效果的编程语言，可能很少有人能提出反对意见。想学习 php 不需要有任何负担，现在去百度上随便搜点教程，你就能开始写出大家都会写出的漂亮代码了。然而目前来说他的就业前景不是那么好——这也不是坏事，因为 1 个写 php 的人就能代替 3 个写 Java 的人， php 的开发效率太高了。",
  "ideo_rust": "Rust",
  "ideo_rust_desc": "恭喜，目前编程领域最出风头的语言，一个<a href=\"https://k.sina.com.cn/article_1746173800_68147f68019019fu3.html\">连美国总统拜登都支持</a>的语言，是被测试为最符合你的语言。<br>作为标榜自己现代且具有学术正确性的语言， Rust 在 C++ 等系统级语言直截了当的命令式风格中添加了非常大量的偏描述性的函数式编程口味，请你任选。同时， Rust 毫无疑问地认为程序员写出高效，正确的代码是编程的要务，所以它有非常严格且复杂的各种如类型系统检查、借用检查、格式检查等约束工具，让你的代码高效且安全，直到重构那天都不需要再对它进行改动——它不会出问题的（但你可能需要经常重构）。毫无疑问，它是个新秀， 2025 年 5 月 15 日才过完它的 10 岁生日，这也意味着它具有大量现代——或者很多人口中的反人类——的用法和结构。它过于正确，没有能够让你把内存随便乱扔的垃圾回收器等设计，以至于它现在的主要用途是和系统底层直接对话，更加贴近物理现实。以上四点分别对应你之前选择的选项。<br>如果你觉得这个语言非常合你的胃口，你可以去 <a href=\"https://rust-lang.org/\">Rust 的官网</a>寻找学习资料。",
  "ideo_ruby": "Ruby",
  "ideo_ruby_desc": "Ruby 的宗旨是使人编写感到愉悦，所以不论是直接了当的命令式代码，还是更具有描述性的函数式代码，都是你可以编写的。除此之外，为了使你更舒适地编写，也是 Ruby 社区奉行“干一件事可以有多种不同方法”，它没有严格的类型检查来强制你编写诸如号称“正确”或“安全”的代码，使你更加自由。然而，在其网站后端服务器的生态位来看，它的理念是稍微更加传统，有年代感的。它的语法也是非常自由，随性，讲究自然。以上四点分别对应你之前选择的选项。<br>Ruby 虽然目前身处这些编程语言中并不是那么亮眼了，但它所带来的很多概念，如包管理和灵活性，都启发了现在的这些编程语言。可以说， Ruby 不是一种语言，而是一种态度。如果你感觉能对的上它的电波，可以<a href=\"https://www.ruby-lang.org/zh_cn/\">去他们的官网</a>详细了解。",
  "ideo_kotlin": "Kotlin",
  "ideo_kotlin_desc": "Kotlin 可以理解为更现代的 Java ，而现代比较流行偏描述性的函数式编程，所以它除了 Java 的直截了当的命令式，你若想用，也可以用函数式代码编写程序。和 Java 一样， Kotlin 也是一个面向对象语言，为它带来了强大的类型约束，让你写出准确而不过于灵活的代码。虽然说它声称自己更加现代，但其仍然依附于 Java 工具链，如果你不喜欢 Java 这种较为传统的语言，你可能基本不会对它感兴趣。同样与 Java 类似，它更多用在工程方面而非理论方面，如安卓应用开发等。以上四点分别对应你之前选择的选项。<br>如果你想了解更多关于它的信息，可以去<a href=\"https://kotlinlang.org/\">官网</a>详细了解。",
  "ideo_prolog": "Prolog / Lean / Haskell",
  "ideo_prolog_desc": "你也就适合一阶谓词逻辑编程语言或者基于类型论的形式化验证和数学证明辅助语言了，要么就是带有非限定性语义和强静态类型的函数式编程语言。欸，你知道 Haskell 里的单子就是自函子范畴上的一个幺半群吗？其组合运算是两个自函子的组合 F.F 到一个自函子 F 的自然变换 μ ，其单位态射是恒等函子 Id 到自函子 F 的自然变换 η 。这个幺半群的单位态射就是 Haskell 中类单子的 return 函数；而这个幺半群的组合则是 Haskell 中类单子的 join 函数。二者都是一个自然变换。你懂我的意思，对吧。",
  "ideo_verilog": "Verilog",
  "ideo_verilog_desc": "注意，这不是一个编程语言，而是一个硬件描述语言——没错，这个语言用于把复杂的逻辑电路图纸写成文本。这个语言没有普通编程语言的所谓“内存”“运行环境”等概念，而是添加了“电线”“时序”等实际物理电路概念。正因如此，它的思想模型与大多数“玩文字游戏”的通用编程语言不同，具有一些现实物理世界带来的诡异限制（如时序），使其比较特别。",
  "ideo_haskell": "Haskell",
  "ideo_haskell_desc": "Haskell 是一种纯函数式语言，意味着你可以只写一点点直截了当的命令式代码，而更多的是当你把问题描述清楚，你的问题就被 Haskell 解决了。它同时还是一个强类型语言，它那复杂得跟语言本身一样的类型系统会详细且精确地约束你的程序（甚至大多数时候你看到一个东西的类型，就能知道这个东西是干什么的），使你写出正确且高质量的代码。它是一个非常纯的纯函数式语言（反复强调），以至于在不得不写命令式的地方（极少），它也用一种叫做“单子”的高端数学概念来让你写出看似命令式实则函数式的代码。以上三点分别对应你之前选择的选项。<br>Haskell 是极端函数式主义者的信仰。它和那些只会命令这命令那的命令式语言不同，它是一个非常具有数学和逻辑学气息的高端语言。如果你也喜欢函数式，你会在它所创造的乌托邦中流连忘返，忘记你的电脑、手机的冯诺依曼架构也是命令式这一令人痛心的事实，远离肮脏的令人失望的物理世界，进入离散且连续的美妙数学殿堂。更多内容你可以去<a href=\"https://www.haskell.org/\">官网</a>详细了解。",
  "ideo_commmon lisp": "Commmon Lisp",
  "ideo_commmon _desclisp": "Lisp 是一种受到函数式语言启发的语言，它不需要你写出直截了当的命令式代码，而是一种描述性的，注重过程的函数式代码。 Common Lisp 是 Lisp 的一种方言，它基本上没有什么限制你，要求你写出正确代码的类型系统，你可以完全自由发挥，写出你所喜爱的代码（炫技）。除了 Common Lisp 之外， Lisp 家族还有其他方言，但 Common Lisp 是其中最被广泛使用的。以上三点分别对应你之前选择的选项。<br>Common Lisp 专给那些自认为自己很聪明而又确实很聪明的人使用。它与 Python 这种啰嗦而烦人的语言不同，它的代码非常“精华”，熟练的人可以一行代码就解决 Python 需要几十行才能解决的问题。它又没有如类型检查之类的限制，所以你可以尽情发挥自己的创造力，越写越爽。函数式思想来自于神秘的 Lambda 演算——一种逻辑学概念。而 Lisp 又是无类型函数式中最具有代表性的，有人说程序员一生中必须要写一次 Lisp ，否则就是白当程序员了，见仁见智你可以自己体验。更多内容你可以去<a href=\"https://common-lisp.net/\">官网</a>详细了解。",
  "ideo_elisp": "Elisp",
  "ideo_elisp_desc": "Emacs lisp(Elisp)是传奇编辑器<a href=\"https://www.gnu.org/software/emacs/\">GNU EMACS</a>的内置编程配置语言，为什么要单独提他呢？因为emacs这个编辑器太出色了！使用这个编辑器，你可以尽情定制，任性地扩展你想要的东西，以此满足你的开发需求，配emacs环境的过程，就像一点一点修缮你的小家一样温馨舒适，从茅草屋到海景房，需要你一步一步拿elisp写出来！我知道你早已受够提着包住进一个品味欠缺的老板开的千篇一律的单身公寓，那种感觉真糟糕！ 然而为什么你要执迷不悟地拿elisp配你的小编辑器呢，还不是这个社区的社区的生态是由一群很有品味的朋友搭起来的，首先，elisp语言的鼻祖是最古老的函数式语言，在这里你通过不断描述呈现一个清晰的问题来解决它，而非暴力的调用类；你的代码可以是自由灵活的，而不需要受到类型检查器之类的严格限制；你可以通过灵活的buffer来配置和调试，而非一次一次地编译运行，其次，如果你不小心发现了开屏主面板后的小文字“ Free as free speech, free as free Beer”，你或许一不小心开始研究起自由软件运动并逐渐沉迷其中；令人感到伤心的是因为使用emacs的初印象像是让人住进茅草屋，时代审美的懒惰让人们安逸于直接住进单身公寓，最终这款语言竟变得小众，现在谁研究这款语言会被俗子们嘲笑他是误入桃花源身处的桃花源居士。",
  "ideo_lua": "Lua",
  "ideo_lua_desc": "Lua 是一个非常自由的语言，不论是直截了当的命令式风格，还是偏描述性的函数式风格，你都可以随自己的爱好使用。同时， lua 的类型检查形同虚设，这意味着没有太多限制要求你必须写出“正确”的代码，你可以随着自己的喜好自由发挥。 Lua 最初发明是为了方便地嵌入到其他程序中——因为它是一个很容易被电脑“读懂”的语言，然而在当今的时代，电子产品的性能在大部分方面是过剩的，所以它的理念也稍微有些传统。它是一个比较优雅的语言，各种语言规范写得非常清晰而且简洁，这也和它的轻量级所对应。以上四点分别对应你之前选择的选项。<br>你没有必要专门去学 Lua ，只是说在各种方面，会一定程度的 Lua 很方便。如 Lua 可以写小脚本，一些游戏外挂就是用它写的；一种高度可配置的代码编辑器 NeoVim 的配置文件也是用 Lua 写的；还有很多游戏的模组，都可以用 Lua 进行编写。更多内容你可以去<a href=\"https://www.lua.org/\">他们那简洁得跟 Lua 本身一样的官网</a>详细了解。",
  "ideo_ocaml": "OCaml",
  "ideo_ocaml_desc": "OCaml 主要是一个函数式语言，与直截了当的命令式语言不同，在函数式语言中，解决问题的方法是描述问题。同时， OCaml 是一个强类型语言，它有严格的类型检查机制，可以使你写出正确的代码。然而，它并不是一个纯的函数式强类型语言，为了方便编写各种代码，它融入了如面向对象编程（ OCaml 的 O 就表示 Object ）等其他编程范式。以上三点分别对应你之前选择的选项。<br>如果你还对它可以用来解决什么问题比较疑惑，我只能说——任何问题。喜欢它的人会尝试使用它解决任何可以解决的问题，比如商业交易系统、自动化农业平台、多租户卫星操作系统等，更多内容你可以去<a href=\"https://ocaml.org/\">官网</a>详细了解。",
  "ideo_bash": "bash / sh / batch",
  "ideo_bash_desc": "听说过命令行吗？就是电影里黑客打开的那种黑漆漆的带白色字的可以输东西的界面（或者 90 年代之前连图形操作系统都不存在的时候大家电脑的界面）—— bash / sh 就是 linux / unix 系统操作命令行的语言，而批处理语言（ batch ）则是操作 Windows 系统命令行的语言。<br>这些语言几乎没有任何如包管理、模块概念、类型系统之类的现在正常编程语言有的东西，如果一个普通人尝试用这种东西写大型项目，他更有可能是脑袋被门夹了。如果你认为自己的头脑发达，你可以尝试用他们来构建复杂系统。",
  "ideo_zig": "Zig",
  "ideo_zig_desc": "如果说 Rust 语言是现代版的 C++ ，那么 Zig 就是现代版的 C 语言，具有比较浓烈的直接了当的命令式风格。也同样如 C 语言一般，想要写出正确高效的代码，除了其本身的类型系统对代码的限制之外，你也有很大的灵活空间。与 1972 年就诞生的 C 语言相比， 2015 年诞生的它毫无疑问更加现代，也有很多现代语言流行的概念，如模块概念和类型自动推导。以上三点分别对应你之前选择的选项。<br>如果你喜欢编写纯的 C 语言，但又希望获得现代的生态和基础设施，那么你大概率会喜欢 Zig ！如果你想了解更多关于它的信息，可以去<a href=\"https://ziglang.org/zh-CN/\">官网</a>详细了解。",
  "ideo_brainfxxk": "Brainfuck",
  "ideo_brainfxxk_desc": "Brainfuck 是一种搞笑语言，它要求你操作一条理论无限长度（在原始版本中为 30000 格长度）的每个格子都存储着一个整数的纸带来编写你的程序。你的程序有一个指针在这个纸带上，初始情况下纸带上所有的格子都是 0 。你可以对这个纸带进行总共 6 个操作，分别是：<ol><li><code>&lt;</code> 指针向左移动一格</li><li><code>&gt;</code> 指针向右移动一格</li><li><code>+</code> 让指针所指的格子 +1</li><li><code>-</code> 让指针所指的格子 -1</li><li><code>.</code> 用指针格子里的数字作为 ASCII 码来输出一个字符到屏幕</li><li><code>,</code> 从屏幕读取一个字符，并把它的 ASCII 码放到指针所在的格子里</li></ol>同时，你还可以用 <code>[]</code> 来框起一段代码，指针指向的格子里不为 0 时其中的代码会一直重复执行。好的，一共 8 个符号你学会了，它是图灵完备的，你可以尝试用它写出一个操作系统了。",
  "btn_former": "前者",
  "btn_latter": "后者",
  "btn_harder": "不，还不够难",
  "btn_both": "看情况",
  "btn_easy": "简单",
  "btn_medium": "中等",
  "btn_hard": "困难"
}
